---
type: BRepBuilderEdgeGeometry
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# BRepBuilderEdgeGeometry

`Autodesk.Revit.DB.BRepBuilderEdgeGeometry` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | — | `` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |